RIET/src/AccumulationRegisters/ParcelsOfTransportRequestsWithoutShipment/ParcelsOfTransportRequestsWithoutShipment.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ParcelsOfTransportRequestsWithoutShipment</name>
  <resources>
    <name>NumOfParcels</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Parcel</name>
    <type>
      <types>CatalogRef.Parcels</types>
    </type>
  </dimensions>
  <dimensions>
    <name>TransportRequest</name>
    <type>
      <types>DocumentRef.TransportRequest</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

RIET/src/InformationRegisters/TripNonLawsonCompaniesLogs/TripNonLawsonCompaniesLogs.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>TripNonLawsonCompaniesLogs</name>
  <resources>
    <name>User</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Text</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>LogTo</name>
    <type>
      <types>DocumentRef.TripNonLawsonCompanies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>LogType</name>
    <type>
      <types>CatalogRef.LogTypes</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Date</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/CommonForms/ФормаРедактированияMilageInTrip/Module.bsl
&НаКлиенте
Процедура Ок(Команда)
	
	Если ВариантРедактирования = "Mileage" Тогда
		ЕстьИзмененияMileage = Ложь;
		Для Каждого Строка из Stops Цикл
			
			Если Строка.Mileage <> Строка.NewMileage И ЗначениеЗаполнено(Строка.NewMileage) Тогда
				ЕстьИзмененияMileage = Истина;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЕстьИзмененияMileage Тогда
			ВнестиИзмененияMileage();
		КонецЕсли;
		
	ИначеЕсли ВариантРедактирования = "NumOfParcels" Тогда
		ЕстьИзмененияNumOfParcels = Ложь;
		Для Каждого СтрокаParcel из TripParcels Цикл
			
			Если СтрокаParcel.NumOfParcels <> СтрокаParcel.NewNumOfParcels И ЗначениеЗаполнено(СтрокаParcel.NewNumOfParcels) Тогда
				Если ЗначениеЗаполнено(СтрокаParcel.Остаток) ИЛИ СтрокаParcel.NewNumOfParcels <= СтрокаParcel.Остаток + СтрокаParcel.NumOfParcels Тогда
					ЕстьИзмененияNumOfParcels = Истина;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЕстьИзмененияNumOfParcels Тогда
			ВнестиИзмененияNumOfParcels();
		КонецЕсли;
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Trip = Параметры.Trip;
	ВариантРедактирования = Элементы.ВариантРедактирования.СписокВыбора[0].Значение;
	Элементы.Mileage.Видимость = Истина;
	Элементы.NumOfPacels.Видимость = Ложь;
	Если ЗначениеЗаполнено(Параметры.Trip) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	TripNonLawsonCompaniesStops.НомерСтроки,
		|	TripNonLawsonCompaniesStops.Location,
		|	TripNonLawsonCompaniesStops.Type,
		|	TripNonLawsonCompaniesStops.Mileage,
		|	ВЫРАЗИТЬ(NULL КАК ЧИСЛО(15, 3)) КАК NewMileage
		|ИЗ
		|	Документ.TripNonLawsonCompanies.Stops КАК TripNonLawsonCompaniesStops
		|ГДЕ
		|	TripNonLawsonCompaniesStops.Ссылка = &Trip";
		Запрос.УстановитьПараметр("Trip", Параметры.Trip);
		Результат = Запрос.Выполнить().Выгрузить();
		Stops.Загрузить(Результат);
		
		
		ЗапросNum = Новый Запрос;
		ЗапросNum.Текст = 
		"ВЫБРАТЬ
		|	TripNonLawsonCompaniesParcels.НомерСтроки,
		|	TripNonLawsonCompaniesParcels.Parcel,
		|	TripNonLawsonCompaniesParcels.NumOfParcels,
		|	ЕСТЬNULL(ParcelsOfTransportRequestsWithoutShipmentОстатки.NumOfParcelsОстаток, 0) КАК Остаток,
		|	ВЫРАЗИТЬ(NULL КАК ЧИСЛО(3, 0)) КАК NewNumOfParcels
		|ИЗ
		|	Документ.TripNonLawsonCompanies.Parcels КАК TripNonLawsonCompaniesParcels
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ParcelsOfTransportRequestsWithoutShipment.Остатки КАК ParcelsOfTransportRequestsWithoutShipmentОстатки
		|		ПО TripNonLawsonCompaniesParcels.Parcel = ParcelsOfTransportRequestsWithoutShipmentОстатки.Parcel
		|			И TripNonLawsonCompaniesParcels.Parcel.TransportRequest = ParcelsOfTransportRequestsWithoutShipmentОстатки.TransportRequest
		|ГДЕ
		|	TripNonLawsonCompaniesParcels.Ссылка = &Trip";
		ЗапросNum.УстановитьПараметр("Trip", Параметры.Trip);
		РезультатNum = ЗапросNum.Выполнить().Выгрузить();
		
		TripParcels.Загрузить(РезультатNum);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВнестиИзмененияMileage()
	
	НачатьТранзакцию();
	УстановитьПривилегированныйРежим(Истина);
	Трип = Trip.ПолучитьОбъект();
	Трип.ДополнительныеСвойства.Вставить("ИзменениеMileage", Истина);
	
	Для Каждого Элемент Из Stops Цикл
		
		Если Элемент.Mileage <> Элемент.NewMileage Тогда
			СтрокаСтропов = Трип.Stops.Получить(Элемент.НомерСтроки - 1);
			СтрокаСтропов.Mileage = Элемент.NewMileage;
		КонецЕсли;
		
	КонецЦикла;
	Попытка
		Если Трип.Проведен Тогда
			Трип.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			Трип.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Изменения по километражу внесены в " + Trip);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось внести изменения в " + Trip);
	КонецПопытки;
	ЗафиксироватьТранзакцию();
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ВнестиИзмененияNumOfParcels()
	
	НачатьТранзакцию();
	УстановитьПривилегированныйРежим(Истина);
	Трип = Trip.ПолучитьОбъект();
	Трип.ДополнительныеСвойства.Вставить("ВнестиИзмененияПарселя", Истина);
	ТекстИзменение = "";
	Для Каждого Элемент Из TripParcels Цикл
		
		Если Элемент.NumOfParcels <> Элемент.NewNumOfParcels И ЗначениеЗаполнено(Элемент.NewNumOfParcels) И (Элемент.Остаток + Элемент.NumOfParcels) >= Элемент.NewNumOfParcels Тогда
			СтрокаTripParcel = Трип.Parcels.Получить(Элемент.НомерСтроки - 1);
			СтрокаTripParcel.NumOfParcels = Элемент.NewNumOfParcels;
			ТекстИзменение = ТекстИзменение + "
			| Изменёно значение 'Num of parcels' в строке " + Элемент.НомерСтроки + "- Прежний: " + Элемент.NumOfParcels + ", Новый: " +Элемент.NewNumOfParcels; 
		КонецЕсли;
		
	КонецЦикла;
	Попытка
		Если Трип.Проведен Тогда
			Трип.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			Трип.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Изменения по количеству парселей внесены в " + Trip);
	
	МенеджерЗаписи = РегистрыСведений.TripNonLawsonCompaniesLogs.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.LogTo = Trip;
	МенеджерЗаписи.Date = ТекущаяДата();
	МенеджерЗаписи.LogType = Справочники.LogTypes.ИзменениеРеквизитов;
	МенеджерЗаписи.User = ПараметрыСеанса.ТекущийПользователь;
	МенеджерЗаписи.Text = ТекстИзменение;
	МенеджерЗаписи.Записать();
	
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось внести изменения в " + Trip);
	КонецПопытки;
	ЗафиксироватьТранзакцию();
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры


&НаКлиенте
Процедура ВариантРедактированияПриИзменении(Элемент)
	
	Если ВариантРедактирования = "Mileage" Тогда
		
		Элементы.Mileage.Видимость = Истина;
		Элементы.NumOfPacels.Видимость = Ложь;
		
	ИначеЕсли ВариантРедактирования = "NumOfParcels" Тогда
		
		Элементы.NumOfPacels.Видимость = Истина;
		Элементы.Mileage.Видимость = Ложь;
		
		Для Каждого СтрокаParcel из TripParcels Цикл
			Если НЕ ЗначениеЗаполнено(СтрокаParcel.Остаток) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По parcel - " + СтрокаParcel.Parcel + " нет свободных остатков");
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура TripParcelsNewNumOfParcelsПриИзменении(Элемент)
	
	ТекДанные = Элементы.TripParcels.ТекущиеДанные;
	Если ТекДанные.NewNumOfParcels > ТекДанные.Остаток + ТекДанные.NumOfParcels Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Указанное количество по parcel " + ТекДанные.Parcel + " превышает остаток");
	КонецЕсли;
	
КонецПроцедуры
